№ 1
"""
Задача №25. Решение в группах
Напишите программу, которая принимает на вход
строку, и отслеживает, сколько раз каждый символ
уже встречался. Количество повторов добавляется к
символам с помощью постфикса формата _n.
Input: a a a b c a a d c d d
Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2
Для решения данной задачи используйте функцию
.split()
"""

мой

your_string = input('Введите вашу строку: ')
print('Вы ввели: ', (your_string))

dict = {}
for i in your_string:
    if i not in dict:
        dict[i] = 0

print(dict)

for i in your_string:
    if i in dict:
        print(i, end = '')
        if int(dict[i]) > 0:
            print('_',dict[i],end = '')
        dict[i] += 1
Ваша 

data = "a a a b c a a d c d d".split()
res = {}
for item in data:
    if item not in res:
        print(item, end=" ")
    else:
        print(f"{item}_{res[item]}", end=" ")
    res[item] = res.get(item, 0) + 1


//////*****/////*****//////

№2 """
Задача №27. Решение в группах
Пользователь вводит текст(строка). Словом считается
последовательность непробельных символов идущих
подряд, слова разделены одним или большим числом
пробелов. Определите, сколько различных слов
содержится в этом тексте.
Input: She sells sea shells on the sea shore
The shells that she sells are sea shells I'm sure.
So if she sells sea shells on the sea shore
I'm sure that the shells are sea shore shells
Output: 13
"""


МОЙ

import re

your_sentence_text = input('Введите ваше предложение: ')
print(your_sentence_text)

plist = []

for i in your_sentence_text.split():
    if i.lower() not in plist:
        plist.append(i.lower())

print(plist)

count = 0
for i in plist:
    count += 1

print(count)

ТВОЁ

data = """She sells sea shells on the sea shore The shells
that she sells are sea shells I'm sure.So if she sells sea
shells on the sea shore I'm sure that the shells are sea
shore shells""".lower().split()
print(len(list(set(data))))


//////*****//////******////////
"""
Задача №29. Решение в группах
Ваня и Петя поспорили, кто быстрее решит
следующую задачу: “Задана последовательность
неотрицательных целых чисел. Требуется определить
значение наибольшего элемента
последовательности, которая завершается первым
встретившимся нулем (число 0 не входит в
последовательность)”. Однако 2 друга оказались не
такими смышлеными. Никто из ребят не смог до
конца сделать это задание. Они решили так: у кого
будет меньше ошибок в коде, тот и выиграл спор. За
помощью товарищи обратились к Вам, студентам.
Ваня:

n = int(input())
max_number = 1000
while n != 0:
 n = int(input())
 if max_number > n:
 max_number = n
print(max_number)

Петя:

n = int(input())
max_number = -1
while n < 0:
 n = int(input())
 if max_number < n:
 n = max_number
print(n)
"""

МОЁ

max_number = 0
while True:
    enter_num = int(input("Enter any number: "))
    if max_number < enter_num:
        max_number = enter_num
    elif enter_num == 0:
        print(max_number)
        break

ТВОЁ
She sells sea shells on the sea shore The shells that she sells are sea shells I'm sure.So if she sells sea shells on the sea shore I'm sure that the shells are sea shore shells

